academia/app/controllers/centro_de_treinamentos_controller.rb

  def index
    @centro_de_treinamentos = CentroDeTreinamento.all
---
SELECT "centro_de_treinamentos".* FROM "centro_de_treinamentos"

  def create
    @centro_de_treinamento = CentroDeTreinamento.new(centro_de_treinamento_params)

    respond_to do |format|
      if @centro_de_treinamento.save
---
INSERT INTO "centro_de_treinamentos" ("nome", "cnpj", "responsavel", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "kungfu"], ["cnpj", "989709"], ["responsavel", "marcos"], ["created_at", "2019-10-24 19:27:29.589347"], ["updated_at", "2019-10-24 19:27:29.589347"]]

  def destroy
    @centro_de_treinamento.destroy
---
DELETE FROM "centro_de_treinamentos" WHERE "centro_de_treinamentos"."id" = ?  [["id", 2]]

    def set_centro_de_treinamento
      @centro_de_treinamento = CentroDeTreinamento.find(params[:id])
---
SELECT  "centro_de_treinamentos".* FROM "centro_de_treinamentos" WHERE "centro_de_treinamentos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]