academia/app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("nome", "email", "cpf", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Vanildo"], ["email", "vanildojr33@gmail.com"], ["cpf", "12312312312"], ["created_at", "2019-10-24 02:59:36.440561"], ["updated_at", "2019-10-24 02:59:36.440561"]]

  def update
    respond_to do |format|
      if @usuario.update(usuario_params)
---
UPDATE "usuarios" SET "cpf" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["cpf", "077.178.244-69"], ["updated_at", "2019-10-24 20:14:30.103576"], ["id", 2]]